Documents/ПереоценкаТовараНаКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПереоценкаТовараНаКомиссии</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаКомиссии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтарая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыНаКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаКомиссии</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКомиссионера</Name>
					<Comment>Сумма по к-рой товар передан на комиссию</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПереоценкаТовараНаКомиссии/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

    омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ОбщегоНазначенияСервер.ЗаполнитьРеквизитыДокументаПоУмолчанию(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ТаблицаТовары = ТаблицаТовары();
	ПроверкаВозможностиПроведения(ТаблицаТовары, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры


Процедура ПроверкаВозможностиПроведения(ТаблицаТовары, Отказ)
	
	Ошибки = Новый СписокЗначений;
	
	// Запрет незаполненных установлен в свойствах реквизитов шапки
	
	ПроведениеДокументов.ПроверитьНаТолькоТовары(ТаблицаТовары, Ошибки);
	ПроведениеДокументов.ПроверитьНаОстаткиТоваров(ТаблицаТовары, МоментВремени(), СкладКомиссии, Ошибки, Фирма);
	ПроведениеДокументов.ПроверитьДубли(ТаблицаТовары, Ошибки);	
	
	Для каждого Ош Из Ошибки Цикл
		Отказ = Истина;
		Сообщить(Ош.Значение);
	КонецЦикла; 
	
	Движения.ТоварыНаКомиссии.Записывать 	= Истина;
	
	Для Каждого ТекСтрокаТовары Из ТаблицаТовары Цикл  
		
		// РН ТоварыНаКомиссии
		Движение = Движения.ТоварыНаКомиссии.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход; 
		Движение.Период 			= Дата;
		Движение.Номенклатура 		= ТекСтрокаТовары.Номенклатура;
		Движение.Партия 			= ТекСтрокаТовары.Партия;
		Движение.Контрагент 		= Контрагент;
		Движение.Склад 				= СкладКомиссии;
		Движение.Количество			= ТекСтрокаТовары.Количество;
		Движение.Сумма				= 0;
		Движение.СуммаКомиссионера 	= (ТекСтрокаТовары.Цена - ТекСтрокаТовары.ЦенаСтарая) * ТекСтрокаТовары.Количество; 
		
	КонецЦикла;
	
КонецПроцедуры
 
Функция ТаблицаТовары()

	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура",			"Номенклатура");
	СтруктураПолей.Вставить("ТипНоменклатуры",		"Номенклатура.ТипНоменклатуры");
	СтруктураПолей.Вставить("ЗапретОтгрузки",		"Номенклатура.ЗапретОтгрузки");
	СтруктураПолей.Вставить("Серия",				"Серия");
	СтруктураПолей.Вставить("Партия",				"Партия");
	СтруктураПолей.Вставить("Количество",			"Количество");
	СтруктураПолей.Вставить("Цена",					"Цена");
	СтруктураПолей.Вставить("ЦенаСтарая",			"ЦенаСтарая");
	СтруктураПолей.Вставить("ДокументПрихода",		"Партия.Док");   
	СтруктураПолей.Вставить("Поставщик",			"Партия.Контрагент");   
	
	ЗапросТовары = ПроведениеДокументов.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей);
	ТаблицаТовары = ЗапросТовары.Выгрузить();
	
    Возврат ТаблицаТовары;
	
КонецФункции
